package com.driver.go.base;

/**
 * Created by Administrator on 2017/2/22.
 */

public class Profile {
    public static final String APP_KEY = "81f85312a3cea93426e336681c734b0f";
    public static final int DRIVER_SUBJECT_ONE = 1;//科目类型
    public static final String DRIVER_MODEL_ONE = "c1";//驾照类型
    public static final String TEST_TYPE_ORDER = "order";//顺序联系
    public static final String TEST_TYPE_RANDOM = "random";//随机练习

    public static final int ORDER_TOTAL_ITEM = 1229;//顺序练习总共题目
    public static final int RANDOM_TOTAL_ITEM = 10;//顺序练习总共题目

    public static final String DRIVER_TIP = "最近，交通运输部和公安部联合下发《关于印发机动车驾驶培训教学与考试大纲的通知》，发布了新一版的《机动车驾驶培训教学与考试大纲》。从今年10月1日起施行，2012年发布的《机动车驾驶培训教学与考试大纲》同时废止。\n" +
            "\n" +
            "其实，今年4月，公安部就修改并实施了《机动车驾驶证申领和使用规定》(公安部第139号令)，新规中修改了45项内容，其中就对C1、 C2驾驶证可以自学直考做出了规定。\n" +
            "那么半年后推出的新驾考《大纲》，对于打算考C1、C2驾照的市民来说有哪些变化呢？\n" +
            "考C照，总学时比以前少了新《大纲》对部分车型的培训学时做了调整。其中，C1证和C2证的总学时分别为62学时和60学时，均比原来的要求少了10多个学时。而且新《大纲》对每个学时的具体时间也做了明确规定：每学时为60分钟,其中有效教学时间不得低于45分钟。每个学员课堂学习时间和实际操作时间每天均不得超过4学时。\n" +
            "先考科目一再缴费\n" +
            "每次培训后按时段付费\n" +
            "培训后学员还可给教练打分\n" +
            "\n" +
            "新《大纲》中关于驾考费用与支付方式的规定列明，以后的驾考将施行“先培训后付费”模式。具体做法是：在学员科目一考试合格前不交任何费用，学员科目一考试合格，并通过报名平台成功报名后，再选择班别并缴费。\n" +
            "在新的《机动车驾驶培训费用构成明细表》中，收费项目被分成5大类，分别是相关服务费用(包含教材费、人身意外伤害保险费等)、理论知识培训费、驾驶模拟培训费、基础和场地驾驶培训、道路驾驶训练等。其中，后三项收费又细分为普通时段、高峰时段和节假日时段三类，分别标明学时单价。\n" +
            "另外，各地根据要求还要落实一项工作――每次培训后，学员可按时段给教练打分评价，并通过平台缴费，这样有助于提高教练员的服务和教学质量，也方便通过评价对教练能力进行分级。\n" +
            "培训里程最低不得少于300公里\n" +
            "科目二和科目三可以一起考\n" +
            "新《大纲》指出，各省应当根据实际对各准驾车型培训里程做出相关要求，但最低不得少于300公里。\n" +
            "新《大纲》中所指学时为各车型基本学时要求，如需增加考试内容和项目的，须相应增加学时。\n" +
            "新规还规定，“安全文明驾驶常识”教学应与“道路驾驶”教学交叉融合；“基础和场地驾驶”与“道路驾驶”可交叉训练。也就是说，学员可以一边进行理论学习，一边上车实际操作练习了，科目二与科目三可以相结合。这样做不仅节约时间，也节约了驾考成本。\n" +
            "另外，“道路交通安全法律、法规和相关知识”和“安全文明驾驶常识”教学可采取多媒体教学、远程网络教学、交通安全体验等多种方式，课堂教学不得低于6学时。\n" +
            "相关部门：\n" +
            "新规将更灵活科学地分配教学资源\n" +
            "杭州市机动车管理服务局培训处(驾培管理处)王副处长向记者表示，杭州具体的实施细则目前还在研究和制定中，从这次的驾考新规来看，对考C1、C2的市民主要有几个方面的变化；\n" +
            "1.考试顺序可以打乱。以往都要求按照从科目一至科目三的顺序进行考试，而且科目二、三的培训只看学时多少，不看培训里程，所以学员往往会在难度更高的科目二上占用较多课时。这样一来，学员通过科目二考试后，可能存在刷学时等方式以减少培训时间。\n" +
            "新的《大纲》要求科目三的学时必须要落实到位，而且科目三和科目二的考试顺序可以打乱，也可以同时准备同时考试，驾考灵活度更高了。\n" +
            "2.有些学员可能要买学时了。C1证和C2证的总学时分别为62学时和60学时，比原来的要求少了10多个学时，这是不是意味着驾照更容易考了？\n" +
            "显然不是！王处长说，学员中年龄和接受能力不一，原来的驾考学时可以说保证了大部分人都有足够时间考出，但对于学得快的学员来说，过多的学时就有些浪费了。现在把学时降下来，一小部分学得快的学员还是能及时考出，但大部分学员就可能要在基础学时之外，根据自己的实际需求再购买学时来学习，这样就做到了教学因人而异，让学员有弹性地选择，也可以更科学地分配教学资源。\n" +
            "3.驾考透明度更高了。根据新大纲要求，要实现学员网上预约学习、考试，网上在线支付和评价功能，这样一来，对驾校特别是教练的要求更高，驾考的透明度也更高了，比如学员可以在每次培训后按课时付费，并对教练进行评价，教练教得好不好，通过他的评分体系就能了解得一清二楚。\n" +
            "另外，原来对每个项目的学习和培训时间都有具体要求，但新《大纲》对这一要求逐渐淡化了，学员可按照自己的需求重点学习。\n" +
            "驾校：新规对驾校和教练要求更高了\n" +
            "教练：学驾考总体费用可能适当提高\n" +
            "对于即将实行的新规，杭州的驾校和教练准备好了吗？\n" +
            "市中心一所驾校的丁校长说，最近他们和一些驾校的负责人都在进行新驾考大纲培训，专题会议都已经开了好几次，就等十一以后大家快速适应。\n" +
            "丁校长说，新《大纲》对驾校提出了更严格的考验。目前驾校平台上有100多个教练，今后学员可以自主选择教练，在完成每一个课时后可以再选择，不满意的话可以换教练，还可以给教练打分，这样一来，每个教练自身的服务意识、态度都要提高，经常偷懒、骂学员的教练很可能会因为分数太低导致没人选。另一方面，对驾校来说，环境、车况、服务都要跟上。\n" +
            "另一所驾校的负责人陈先生说，有人担心以后学驾考成本会更高，这个问题要从两方面来看――对于学习能力较强的人来说，可以在基础学时完成学习，不仅学驾考的时间缩短了，费用也会相应减少，但对于学习能力相对弱的学员来说，完成基础学时后自己再掏钱购买学时，费用肯定比以往要高。\n" +
            "另外，新《大纲》规定培训里程不少于300公里，这样一来肯定会增加培训成本，因此综合来说，学驾考的费用应该会适当上涨一些。按照目前行情，学习C1驾照的费用在4500到5000元之间，C2驾照因为车辆成本、油耗更高，在5000元到5500元之间，陈先生认为，“以后考驾照的费用，平均下来预计会增加10%左右。”\n" +
            "记者又询问了几位驾校教练，他们都比较在意今后学员对自己的评价。\n" +
            "教练陈师傅说，每个教练都有自己的教学方式，有的教练对学员比较严格，也是为了学员能更好地掌握驾驶技能，但如果这样就被学员差评，作为教练肯定会觉得冤枉。另一位教练说，以后学习能力较弱的学员要掏的钱更多了，表面看这是在增加教练收入，但无形中可能会造成教练与学员之间产生不信任，比如有的学员可能会因为学习成本较高而给教练差评。";

}
